Revit 2015 API
BaseImportOptions Properties
The BaseImportOptions type exposes the following members.
Properties
Name | Description
AutoCorrectAlmostVHLines
 Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
ColorMode
 Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
CustomScale
 Scaling the import. If this is defined and a valid value (> 0.0), it takes preference over units.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OrientToView
 Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
Placement
 Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
ThisViewOnly
 Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
Unit
 The unit of measure for imported geometry.
VisibleLayersOnly
 Only import the visible layers.
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace